app/controllers/events_controller.rb

INSERT INTO "events" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2014-11-17 00:57:01.242484"], ["updated_at", "2014-11-17 00:57:01.242484"]]
---
  def create
    @event = Event.new(event_params)
    @event.save

SELECT  "events".* FROM "events"  WHERE "events"."id" = ? LIMIT 1  [["id", 0]]
UPDATE "events" SET "description" = ?, "name" = ?, "updated_at" = ? WHERE "events"."id" = 8  [["description", "ddddddddd"], ["name", "ffffffff"], ["updated_at", "2014-11-20 00:52:00.882790"]]
---
  def update
    @event = Event.find(params[:id])
    @event.update_attributes(event_params)