app/controllers/posts_controller.rb

INSERT INTO "posts" ("content", "created_at", "title", "updated_at", "user") VALUES (?, ?, ?, ?, ?)  [["content", "tttttttttttttttttt"], ["created_at", "2014-11-07 08:01:29.685646"], ["title", "lin"], ["updated_at", "2014-11-07 08:01:29.685646"], ["user", "pooooo"]]
---
  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save